Repository: angdit/fitness-flow
Catalog: lib/l10n/app_*.arb
Languages: id

source: hi
id: hai

# welcome
source: Welcome to
id: Selamat Datang di

# best_app
source: The best app for your health dan fitness
id: Aplikasi terbaik untuk kesehatan dan kebugaran Anda

source: Start
id: Mulai

source: STEP
id: LANGKAH

source: Steps
id: Langkah

# enter_name
source: Enter Your Name
id: Masukan Nama Anda

# please_enter_name
source: Please enter a name to continue
id: Silakan masukan nama untuk melanjutkan

source: Next
id: Lanjut

# validation_error_enter_name
source: This field cannot be empty
id: Field ini tidak boleh kosong

# enter_your_weight_now
source: Enter current body weight
id: Masukan berat badan saat ini

# enter_your_weight_target
source: Enter your target weight
id: Masukan target berat badanmu

source: What is your height?
id: Berapa tinggi badanmu?

# enter_your_height
source: Enter your current height
id: Masukan tinggi badan anda saat ini

source: Enter your age
id: Masukan umurmu

# enter_age
source: Enter your current age
id: Masukan umur anda saat ini

source: Which one are you?
id: Yang mana dirimu?

source: Male
id: Laki-laki

source: Women
id: Perempuan

# verification_text_for_gender
source: In order to provide you with a customization experience, we need to know your gender
id: Untuk memberi Anda pengalaman penyesuaian, kami perlu mengetahui jenis kelamin Anda

# daily_physical_activities
source: Daily physical activity
id: Aktivitas fisik harian

# how_often_do_activity_per_day
source: How often do you do physical activity per day
id: Seberapa sering anda melakukan aktivitas fisik perharinya

# first_option_daily_activity
source: Very Light (light physical activity or no physical activity during the day)
id: Sangat Ringan (aktivitas fisik ringan atau tidak ada aktivitas fisik selama hari)

# second_option_daily_activity
source: Light (light physical activity, such as walking or a little exercise, 1-3 days a week)
id: Ringan (aktivitas fisik ringan, seperti berjalan kaki atau sedikit olahraga, 1-3 hari dalam seminggu)

# third_option_daily_activity
source: Moderate (moderate physical activity, e.g. exercising 3-5 days a week)
id: Sedang (aktivitas fisik sedang, misalnya berolahraga 3-5 hari dalam seminggu)

# fourth_option_daily_activity
source: Heavy (high physical activity, such as exercising 6-7 days a week)
id: Berat (aktivitas fisik tinggi, seperti berolahraga 6-7 hari dalam seminggu)

# error_message_for_daily_activity_option
source: Please choose one of the physical activities.
id: Silakan pilih salah satu aktivitas fisik.

source: You are ready!
id: Kamu sudah siap!

# greetings_in_get_started
source: Thank you for taking your time to create an account with us. Now here comes the fun part, let's explore the app.
id: Terima kasih telah meluangkan waktu Anda untuk membuat akun dengan kami. Sekarang inilah bagian yang menyenangkan, mari jelajahi aplikasinya.

# ready
source: Start
id: Mulai

source: CALORIE
id: KALORI

source: BODY WEIGHT
id: BERAT BADAN

source: EXERCISE
id: LATIHAN

source: from
id: dari

source: Not yet
id: Belum

source: choose exercise
id: memilih latihan

source: already settled
id: sudah diselesaikan

# step_target
source: of 10.000 steps
id: dari 10.000 langkah

source: Choose Photo
id: Pilih Foto

source: WEIGHT
id: BERAT

source: AGE
id: UMUR

# tall
source: Height
id: Tinggi

source: Name
id: Nama

source: Save
id: Simpan

source: DAILY INTAKE
id: ASUPAN HARIAN

source: You have consumed
id: Anda telah mengonsumsi

# position_tracker_text
source: in
id: pada

source: of daily goals
id: dari tujuan harian

# calories_have_exceeded
source: Calories have exceeded the daily target !
id: Kalori sudah melebihi target harian !

source: Breakfast
id: Sarapan

source: Lunch
id: Makan Siang

source: Dinner
id: Makan Malam

source: cal
id: kal

source: Calories burned from steps
id: Kalori terbakar dari langkah

source: Calories burned from workouts
id: Kalori terbakar dari latihan

source: journal
id: jurnal

# breakfast_journal
source: BREAKFAST
id: SARAPAN

# lunch_journal
source: LUNCH
id: MAKAN SIANG

# dinner_journal
source: DINNER
id: MAKAN MALAM

source: No data
id: Tidak ada data

source: Meal
id: Makanan

# add_meal
source: Add Meals
id: Tambah Makanan

# choose_your_meal
source: Choose your meals
id: Pilih makanan anda

source: Search
id: Cari

source: Meal Name
id: Nama Makanan

# meal_gram
source: Food Weight per-Gram
id: Berat Makanan per-Gram

# meal_calorie
source: Meal Calorie per-Gram
id: Kalori Makanan per-Gram

# meal_fat
source: Meal Fat per-Gram
id: Lemak Makanan per-Gram

# meal_protein
source: Meal Protein per-Gram
id: Protein Makanan per-Gram

# meal_carbs
source: Meal Carbs per-Gram
id: Karbohidrat Makanan per-Gram

source: Meal Description
id: Deskripsi Makanan

# meal_clasess
source: Meal Classes
id: Golongan Makanan

source: Add Photo
id: Tambah Gambar

source: File Name
id: Nama File

# body_weight_weight_tracker
source: Body Weight
id: Berat Badan

source: NOW
id: SEKARANG

source: My Progress
id: Prosesku

# weight_weight_tracker
source: Weight
id: Berat

# waist_weight_tracker
source: Waist
id: Pinggang

# hand_weight_tracker
source: Hand
id: Tangan

# thigh_weight_tracker
source: Thigh
id: Paha

source: Timeline
id: Lini Masa

source: Add
id: Tambah

# waist_line
source: Current Waist Line
id: Lingkar Pinggang Saat Ini

# hand_circumference
source: Current Hand Circumference
id: Lingkar Tangan Saat Ini

# thigh_circumference
source: Current Thigh circumference
id: Lingkar Paha Saat Ini

source: Date
id: Tanggal

# exercise_wo
source: exercise
id: Latihan

source: Add Exercise
id: Tambah Latihan

source: Choose your Exercise
id: Pilih Latihan Anda

source: Exercise Name
id: Nama Latihan

source: Exercise Calorie
id: Kalori Latihan

source: Exercise Type
id: Tipe Latihan

source: Exercise Description
id: Deskripsi Latihan

source: Exercise Link
id: Tautan Latihan

source: DAILY STEP
id: LANGKAH HARIAN

source: Finish
id: Selesai

# you_reach_daily_steps
source: You have reached
id: Anda telah mencapai

# ten_thousand_steps
source: / 10.000 steps on
id: / 10.000 langkah pada

source: History
id: Riwayat

source: Step History
id: History Langkah

source: Boiled Corn
id: Jagung Rebus

# boiled_corn_desc
source: Boiled corn is a staple food that is rich in carbohydrates, low in fat, and a good source of energy for daily activities. Suitable as part of a healthy diet.
id: Jagung rebus merupakan makanan pokok yang kaya akan karbohidrat, rendah lemak, dan sumber energi yang baik untuk aktivitas harian. Cocok sebagai bagian dari pola makan sehat.

# staple_type_a
source: Group A Staple Food
id: Makanan Pokok Golongan A

# staple_type_b
source: Group B Staple Food
id: Makanan Pokok Golongan B

source: Boiled Potato
id: Kentang Rebus

# boiled_potato_desc
source: Boiled potato are a source of carbohydrates that are low in fat and high in fiber. Ideal for meeting energy needs and keeping you fuller for longer.
id: Kentang rebus adalah sumber karbohidrat yang rendah lemak dan tinggi serat. Ideal untuk memenuhi kebutuhan energi dan menjaga kenyang lebih lama.

source: White Rice
id: Nasi Putih

# white_rice_desc
source: White rice is a staple food with high carbohydrates that provide quick energy. Despite being high in calories, white rice is often a major part of the daily diet.
id: Nasi putih adalah makanan pokok dengan karbohidrat tinggi yang memberikan energi cepat. Meskipun tinggi kalori, nasi putih sering menjadi bagian utama dalam pola makan sehari-hari.

source: Grilled Chicken
id: Ayam Panggang

# grilled_chicken_desc
source: Grilled chicken is a source of high protein that is low in fat. It's great for building muscle and is suitable for a healthy, nutritionally balanced diet.
id: Ayam panggang adalah sumber protein tinggi yang rendah lemak. Sangat baik untuk membangun otot dan cocok untuk menu diet sehat dengan kandungan gizi seimbang.

# protein_type_a
source: Group A Protein Food
id: Makanan Protein Golongan A

source: Fried Chicken
id: Ayam Goreng

# fried_chicken_desc
source: Fried chicken can be a source of protein, but it is high in fat and calories.
id: Ayam goreng bisa jadi sumber protein, tapi memiliki kandungan yang tinggi lemak dan kalori.

# protein_type_b
source: Group B Protein Food
id: Makanan Protein Golongan B

source: Roast Beef
id: Daging Sapi Panggang

# roast_beef_desc
source: Roast beef is high in protein and low in fat, ideal for building muscle and recovering after a workout.
id: Daging sapi panggang kaya protein dan rendah lemak, ideal untuk membangun otot dan memulihkan tubuh setelah workout.

source: Boiled Shrimp
id: Udang Rebus

# boiled_shrimp_desc
source: Boiled shrimp are rich in protein, low in fat and easy to digest, making them an ideal choice to support muscle recovery after a workout.
id: Udang rebus kaya protein, rendah lemak, dan mudah dicerna, menjadikannya pilihan ideal untuk mendukung pemulihan otot setelah latihan.

source: Grilled Shrimp
id: Udang Panggang

# grilled_shrimp_desc
source: Grilled shrimp is protein-rich, low-fat and delicious, making it the perfect choice to support muscle recovery after a workout.
id: Udang panggang kaya protein, rendah lemak, dan lezat, menjadikannya pilihan sempurna untuk mendukung pemulihan otot setelah latihan.

source: Baked Salmon
id: Salmon Panggang

# baked_salmon_desc
source: Baked salmon is rich in protein, omega-3 fatty acids and low in fat, making it an ideal choice to support post-workout muscle recovery and growth.
id: Ikan salmon panggang kaya protein, asam lemak omega-3, dan rendah lemak, menjadikannya pilihan ideal untuk mendukung pemulihan dan pertumbuhan otot setelah latihan.

source: Fried Squid
id: Cumi Goreng

# fried_squid_desc
source: Crispy fried squid with seasoned flour, perfect for a snack or side dish.
id: Cumi yang digoreng renyah dengan tepung berbumbu, cocok untuk camilan atau lauk.

source: Boiled Squid
id: Cumi Rebus

# boiled_squid_desc
source: Braised squid makes for a healthy and low-fat dish.
id: Cumi yang direbus menghasilkan hidangan sehat dan rendah lemak.

source: Chicken Sausage
id: Sosis Ayam

# chicken_sausage_desc
source: Chicken sausage is made from chicken meat that is processed for practical consumption.
id: Sosis ayam dibuat dari daging ayam yang diolah praktis untuk dikonsumsi.

# protein_type_c
source: Group C Protein Food
id: Makanan Protein Golongan C

source: Brown Rice
id: Nasi Merah

# brown_rice_desc
source: Brown rice contains complex carbohydrates for long-lasting energy.
id: Nasi merah mengandung karbohidrat kompleks untuk energi tahan lama.

source: Staple Food
id: Makanan Pokok

source: Avocado
id: Alpukat

# avocado_desc
source: Avocado is a fruit that contains healthy fats that are good for energy and recovery.
id: Alpukat menjadi buah yang mengandung lemak sehat sehingga baik untuk energi dan pemulihan.

source: Fruit
id: Buah

source: Mango
id: Mangga

# mango_desc
source: Mango is a rich in vitamins and natural energy from fruit sugars.
id: Mangga kaya vitamin dan energi alami dari gula buah.

source: Banana
id: Pisang

# banana_desc
source: Bananas are a quick source of energy from natural carbohydrates.
id: Pisang sumber energi cepat dari karbohidrat alami.

source: Strawberry
id: Stroberi

# strawberry_desc
source: Strawberries are rich in vitamin C and low in calories.
id: Stroberi kaya vitamin C dan rendah kalori.

source: Nutrition
id: Nutrisi

source: Fat
id: Lemak

source: Add to Journal
id: Tambahkan ke Jurnal

# carbs
source: Carbohydrates
id: Karbohidrat

# chest_type
source: Chest
id: Dada

# diamond_push_up_desc
source: A variation of the traditional push up that puts more pressure on the triceps.
id: Variasi dari push up tradisional yang menempatkan lebih banyak tekanan pada trisep.

source: Squat Jump
id: Lompat Jongkok

# legs_type
source: Legs
id: Kaki

# legs_desc
source: Exercises that involve a squat followed by a vertical jump after reaching the bottom position of the squat.
id: Latihan yang melibatkan gerakan squat diikuti dengan loncatan vertikal setelah mencapai posisi bawah squat.

# shoulders_type
source: Shoulders
id: Bahu

# lateral_raises_desc
source: Lateral raises are one of the strength exercises used to isolate the lateral deltoid muscle, which is located on the outside of the shoulder.
id: Lateral raise adalah salah satu latihan kekuatan yang digunakan untuk mengisolasi otot deltoid lateral, yang terletak di bagian luar bahu.

# arm_circle_desc
source: Arm circles are warm-up exercises that are often performed before strength training or other sports exercises.
id: Arm circles adalah latihan pemanasan yang sering dilakukan sebelum latihan kekuatan atau latihan olahraga lainnya.

# bench_press_desc
source: Bench press is one of the main strength exercises commonly performed in weight training programs.
id: Bench press adalah salah satu latihan kekuatan utama yang umum dilakukan dalam program latihan beban.

source: Skipping Rope
id: Lompat Tali

# full_body_type
source: Full Body
id: Seluruh Tubuh

# skipping_rope_desc
source: Skipping rope is a full-body exercise as it involves various muscles and body systems to perform the movements effectively.
id: Lompat tali termasuk olahraga bagian seluruh tubuh karena melibatkan berbagai otot dan sistem tubuh untuk melakukan gerakan secara efektif.

# jumping_jacks_desc
source: Jumping jacks are a total-body workout because they involve almost all major muscle groups.
id: Jumping jack termasuk olahraga bagian seluruh tubuh (total-body workout) karena gerakannya melibatkan hampir semua kelompok otot utama.

# abs_type
source: Abs
id: Perut

# sit_up_desc
source: Crunches are an exercise that focuses on the abdominal muscles, especially the core muscles.
id: sit-up termasuk olahraga yang fokus pada otot perut, khususnya bagian otot inti.

source: Squat
id: Berjongkok

# squat_desc
source: Squats are physical exercises performed by bending the legs to resemble a squatting position or sitting on a chair.
id: Squat adalah latihan fisik yang dilakukan dengan cara menekuk kaki hingga menyerupai posisi berjongkok atau duduk di kursi.

source: Spinning
id: Bersepeda Statis

# spinning_desc
source: Spinning (high-intensity stationary cycling) is an exercise that focuses on the legs.
id: Spinning (bersepeda statis dengan intensitas tinggi) termasuk olahraga yang fokus pada bagian kaki.

source: Rowing
id: Mendayung

# rowing_desc
source: Rowing using machines (indoor rowing) is a full-body sport as it involves almost all major muscle groups simultaneously.
id: Rowing menggunakan mesin (indoor rowing) adalah olahraga yang termasuk seluruh tubuh karena melibatkan hampir semua kelompok otot besar secara bersamaan.

source: Stair Climbing
id: Naik Tangga

# stair_climbing_desc
source: Stair climbing is an exercise that mainly involves the legs
id: Naik tangga adalah olahraga yang terutama melibatkan bagian kaki.

# elliptical_desc
source: An elliptical is a cardio machine that involves movements like running or walking without direct impact on the joints.
id: Elliptical adalah mesin kardio yang melibatkan gerakan seperti berlari atau berjalan tanpa impact langsung pada sendi.

# px_desc
source: P90X is an intense workout program designed to engage almost the entire body.
id: P90X adalah program latihan intensif yang dirancang untuk melibatkan hampir seluruh tubuh.

# muay_thai_desc
source: Muay Thai is a martial arts sport that involves striking techniques using hands, elbows, knees, and feet. It involves almost the entire body.
id: Muay Thai adalah olahraga bela diri yang melibatkan teknik-teknik serangan menggunakan tangan, siku, lutut, dan kaki. Olahraga ini melibatkan hampir seluruh tubuh.

source: Minutes
id: Menit

# minutes_wo
source: Enter Duration (minimum 1 minute)
id: Masukkan Durasi (minimal 1 menit)

source: See Tutorial
id: Lihat Tutorial

source: Meals Data Details
id: Detail Data Makanan

source: Data Details
id: Detail Data

# validation_choose_one_eat_activity
source: Please choose one of the meal times.
id: Silakan pilih salah satu waktu makan.

# validation_check_your_form
source: Please check and complete your form
id: Harap periksa dan lengkapi form anda

source: FAILED
id: GAGAL

source: Please select a date
id: Harap pilih tanggal

source: Attention
id: Perhatian

source: Success
id: Berhasil

source: Meal added successfully
id: Makanan berhasil ditambahkan

source: Exercise added successfully
id: Latihan berhasil ditambahkan

source: Exercise status successfully changed
id: Status latihan berhasil diubah

source: Exercise successfully deleted
id: Latihan berhasil dihapus

source: Daily calories successfully deleted
id: Kalori harian berhasil dihapus

source: Daily calories added successfully
id: Kalori harian berhasil ditambahkan

source: Login Successful
id: Login Berhasil

source: Profile update successful
id: Update profil berhasil

source: Weight added successfully
id: Berat badan berhasil ditambahkan

source: Daily steps added successfully
id: Langkah harian berhasil ditambahkan

source: Weight successfully deleted
id: Berat berhasil dihapus

source: Daily exercise successfully added
id: Latihan harian berhasil ditambahkan

source: Image successfully selected
id: Gambar berhasil dipilih

source: Image not selected
id: Gambar tidak dipilih

# data_must_be_greater_than_zero
source: Data must be greater than 0
id: Data harus lebih dari 0

source: Exercise Calories per Minute
id: Kalori Latihan per Menit

source: Monday
id: Senin

source: Tuesday
id: Selasa

source: Wednesday
id: Rabu

source: Thursday
id: Kamis

source: Friday
id: Jumat

source: Saturday
id: Sabtu

source: Sunday
id: Minggu

source: January
id: Januari

source: February
id: Februari

source: March
id: Maret

source: May
id: Mei

source: June
id: Juni

source: July
id: Juli

source: August
id: Agustus

source: October
id: Oktober

source: December
id: Desember

source: Calories have exceeded the daily target !
id: Kalori sudah melebihi target harian !

source: Daily calorie targets are invalid !
id: Target kalori harian tidak valid!

source: Snack
id: Camilan

# update_content
source: Data Updated Successfully
id: Data Berhasil Diperbaharui

# allergy_note
source: Take note of your allergies
id: Catat Alergi Anda

source: Your Allergy Notes
id: Catatan Alergi Anda

source: Note Successfully Deleted
id: Catatan Berhasil Dihapus

source: Note Successfully Added
id: Catatan Berhasil Ditambahkan

source: Allergy Warning!
id: Peringatan Alergi!

# allergy_warning_desc
source: On this food, you have an allergy. Are you sure you want to add them?
id: Pada makanan ini, Anda memiliki alergi. Apakah Anda yakin ingin menambahkannya?

source: yes
id: Iya

source: No
id: Tidak

source: Current Body Weight
id: Berat Badan Saat Ini

source: Tracking Saved Successfully!
id: Tracking Berhasil Disimpan!

source: Total Steps :
id: Total Langkah :

source: Calories Burned :
id: Kalori Terbakar :

source: Time Out
id: Waktu Habis

source: Exercise time is over!
id: Waktu latihan telah selesai!

source: Done
id: Selesai

source: Pause
id: Jeda

source: Resume
id: Lanjutkan

source: No results found
id: Hasil tidak ditemukan

source: Data not available
id: Data tidak tersedia

source: Vegetable
id: Sayur

# choose_meal_group
source: Choose Meal Groups
id: Pilih Golongan Makanan

source: Exercise Status
id: Status Latihan

source: Exercise is complete
id: Latihan sudah selesai

source: Exercise is not yet complete
id: Latihan belum selesai

source: Meal successfully deleted
id: Makanan berhasil dihapus

source: Workout successfully deleted
id: Latihan berhasil dihapus

source: yo
id: thn

source: DELETE MEAL?
id: HAPUS MAKANAN?

# are_you_sure_delete_meal
source: Are you sure about deleting this meal data? If this meal is deleted then the data will be lost permanently.
id: Apakah kamu yakin menghapus data makanan ini? Jika makanan ini dihapus maka data akan hilang permanen.

source: DELETE EXERCISE?
id: HAPUS LATIHAN?

# are_you_sure_delete_exercise
source: Are you sure about deleting this exercise data? If this exercise is deleted then the data will be lost permanently.
id: Apakah kamu yakin menghapus data latihan ini? Jika latihan ini dihapus maka data akan hilang permanen.

source: DELETE NOTE?
id: HAPUS CATATAN?

# are_you_sure_delete_note
source: Are you sure about deleting this note data? If this note is deleted then the data will be lost permanently.
id: Apakah kamu yakin menghapus data catatan ini? Jika catatan ini dihapus maka data akan hilang permanen.
